results/nginx/ab_c50.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        nginx/1.29.7
Server Hostname:        127.0.0.1
Server Port:            3003

Document Path:          /d165e32
Document Length:        225 bytes

Concurrency Level:      50
Time taken for tests:   0.315 seconds
Complete requests:      1000
Failed requests:        0
Non-2xx responses:      1000
Total transferred:      605000 bytes
HTML transferred:       225000 bytes
Requests per second:    3171.59 [#/sec] (mean)
Time per request:       15.765 [ms] (mean)
Time per request:       0.315 [ms] (mean, across all concurrent requests)
Transfer rate:          1873.84 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.4      0       6
Processing:     2   15   3.6     14      25
Waiting:        2   15   3.6     14      25
Total:          4   15   3.5     14      25

Percentage of the requests served within a certain time (ms)
  50%     14
  66%     15
  75%     16
  80%     16
  90%     21
  95%     23
  98%     24
  99%     24
 100%     25 (longest request)